MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/CY8C4147LDA-S283/mcu.h
/*******************************************************************************
*                                     CAN
*******************************************************************************/

#define CAN_BASE                                0x402E0000UL
#define CAN                                     ((CAN_Type*) CAN_BASE)                                            /* 0x402E0000 */
#define CAN_TX0                                 ((CAN_TX_Type*) &CAN->TX[0])                                      /* 0x402E0020 */
#define CAN_TX1                                 ((CAN_TX_Type*) &CAN->TX[1])                                      /* 0x402E0030 */
#define CAN_TX2                                 ((CAN_TX_Type*) &CAN->TX[2])                                      /* 0x402E0040 */
#define CAN_TX3                                 ((CAN_TX_Type*) &CAN->TX[3])                                      /* 0x402E0050 */
#define CAN_TX4                                 ((CAN_TX_Type*) &CAN->TX[4])                                      /* 0x402E0060 */
#define CAN_TX5                                 ((CAN_TX_Type*) &CAN->TX[5])                                      /* 0x402E0070 */
#define CAN_TX6                                 ((CAN_TX_Type*) &CAN->TX[6])                                      /* 0x402E0080 */
#define CAN_TX7                                 ((CAN_TX_Type*) &CAN->TX[7])                                      /* 0x402E0090 */
#define CAN_RX0                                 ((CAN_RX_Type*) &CAN->RX[0])                                      /* 0x402E00A0 */
#define CAN_RX1                                 ((CAN_RX_Type*) &CAN->RX[1])                                      /* 0x402E00C0 */
#define CAN_RX2                                 ((CAN_RX_Type*) &CAN->RX[2])                                      /* 0x402E00E0 */
#define CAN_RX3                                 ((CAN_RX_Type*) &CAN->RX[3])                                      /* 0x402E0100 */
#define CAN_RX4                                 ((CAN_RX_Type*) &CAN->RX[4])                                      /* 0x402E0120 */
#define CAN_RX5                                 ((CAN_RX_Type*) &CAN->RX[5])                                      /* 0x402E0140 */
#define CAN_RX6                                 ((CAN_RX_Type*) &CAN->RX[6])                                      /* 0x402E0160 */
#define CAN_RX7                                 ((CAN_RX_Type*) &CAN->RX[7])                                      /* 0x402E0180 */
#define CAN_RX8                                 ((CAN_RX_Type*) &CAN->RX[8])                                      /* 0x402E01A0 */
#define CAN_RX9                                 ((CAN_RX_Type*) &CAN->RX[9])                                      /* 0x402E01C0 */
#define CAN_RX10                                ((CAN_RX_Type*) &CAN->RX[10])                                     /* 0x402E01E0 */
#define CAN_RX11                                ((CAN_RX_Type*) &CAN->RX[11])                                     /* 0x402E0200 */
#define CAN_RX12                                ((CAN_RX_Type*) &CAN->RX[12])                                     /* 0x402E0220 */
#define CAN_RX13                                ((CAN_RX_Type*) &CAN->RX[13])                                     /* 0x402E0240 */
#define CAN_RX14                                ((CAN_RX_Type*) &CAN->RX[14])                                     /* 0x402E0260 */
#define CAN_RX15                                ((CAN_RX_Type*) &CAN->RX[15])                                     /* 0x402E0280 */

/*******************************************************************************
*                                     EXCO
*******************************************************************************/

#define EXCO_BASE                               0x402F0000UL
#define EXCO                                    ((EXCO_Type*) EXCO_BASE)                                          /* 0x402F0000 */

/*******************************************************************************
*                                     SAR
*******************************************************************************/

#define SAR0_BASE                               0x403A0000UL
#define SAR0                                    ((SAR_Type*) SAR0_BASE)                                           /* 0x403A0000 */

/*******************************************************************************
*                                     PASS
*******************************************************************************/

#define PASS0_BASE                              0x403F0000UL
#define PASS0                                   ((PASS_Type*) PASS0_BASE)                                         /* 0x403F0000 */
#define PASS0_DSAB                              ((PASS_DSAB_Type*) &PASS0->DSAB)                                  /* 0x403F0E00 */

/** \} CY8C4147LDA-S283 */

#endif /* _CY8C4147LDA_S283_H_ */


/* [] END OF FILE */
